app/controllers/api/v1/food_items_controller.rb

	def index
		if(params[:food_item_id])
			begin
				render json: FoodItem.find_by_id(params[:food_item_id])
			rescue
				render json: {"status" => "failure"} , status: 400
			end
		else
			render json: FoodItem.all, status: 200
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT 1  [["id", 1]]
SELECT "food_items".* FROM "food_items"

	def create

		begin
			item = FoodItem.create(name: params[:name], price: params[:price], quantity_left: params[:quantity])
---
INSERT INTO "food_items" ("name", "price", "quantity_left", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Maggi"], ["price", 15], ["quantity_left", 10], ["created_at", "2016-02-11 07:08:12.724091"], ["updated_at", "2016-02-11 07:08:12.724091"]]