app/controllers/api/v1/orders_controller.rb

INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-02-09 11:52:26.655380"], ["updated_at", "2016-02-09 11:52:26.655380"]]
INSERT INTO "order_details" ("order_id", "food_item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 4], ["food_item_id", 1], ["quantity", 2], ["created_at", "2016-02-09 11:53:25.633687"], ["updated_at", "2016-02-09 11:53:25.633687"]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 24]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? AND "orders"."user_id" = ? LIMIT 1  [["id", 24], ["user_id", 1]]
---
	def create

		begin
			str = params[:items].to_json
			arr = JSON.parse(str)

			@current_order = Order.create

			arr.each do |item|
				odt = OrderDetail.create(order_id: @current_order.id, food_item_id: item["food_item_id"],quantity: item["quantity"])

				if !odt.errors.empty?
					raise "Insufficient Items"
				end
			end

			@current_user.orders << @current_order

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."id" = ?  [["order_id", 3], ["id", 6]]
DELETE FROM "order_details" WHERE "order_details"."id" = ?  [["id", 22]]
INSERT INTO "order_details" ("order_id", "food_item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 18], ["food_item_id", 2], ["quantity", 30], ["created_at", "2016-02-11 07:17:07.957705"], ["updated_at", "2016-02-11 07:17:07.957705"]]
---
	def update

		begin
			element = @current_order.order_details.where(id: params[:order_detail_id])[0]
			element.destroy

			@current_order.order_details << OrderDetail.new(order_id: params[:order_id], food_item_id: params[:food_item_id], quantity: params[:quantity])

UPDATE "orders" SET "delivered" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["delivered", "t"], ["updated_at", "2016-02-09 18:19:41.678650"], ["id", 1]]
---
	def delivered
		begin
			@current_order.delivered = true
			@current_order.save