app/controllers/api/v1/order_details_controller.rb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."id" = ?  [["order_id", 3], ["id", 3]]
DELETE FROM "order_details" WHERE "order_details"."id" = ?  [["id", 3]]
INSERT INTO "order_details" ("order_id", "food_item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 3], ["food_item_id", 2], ["quantity", 3], ["created_at", "2016-02-09 19:12:47.728139"], ["updated_at", "2016-02-09 19:12:47.728139"]]
---
	def update

		element = @current_order.order_details.where(id: params[:order_detail_id])[0]
		element.destroy

		@current_order.order_details << OrderDetail.new(order_id: params[:order_id], food_item_id: params[:food_item_id], quantity: params[:quantity])