app/controllers/api/v1/payments_controller.rb

	def received
		@current_order.payment = "received"
		@current_order.save
---
UPDATE "orders" SET "payment" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["payment", "received"], ["updated_at", "2016-02-10 07:46:49.762183"], ["id", 1]]