app/controllers/api/v1/users_controller.rb

	def create
		@current_user = params[:username] ? User.create(name: params[:username]) : nil
---
INSERT INTO "users" ("name", "created_at", "updated_at", "api_key") VALUES (?, ?, ?, ?)  [["name", "Pulkit Sharma"], ["created_at", "2016-02-09 08:38:25.045166"], ["updated_at", "2016-02-09 08:38:25.045166"], ["api_key", "ebff9194203d27ae07c185383c6b61f7"]]

	def orders
		od = @current_user.orders.all
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]